/* Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.
[3 7 22 2 78] -> 76
Используйте NextDouble().
 */
int size = 10;
double[] array = new double[size];
Random rand = new Random();
for (int i = 0; i < size; i++)
{
    array[i] = rand.NextDouble();
}
Console.WriteLine("Массив:");
for (int i = 0; i < size; i++) 
{
    Console.Write(array[i] + " ");
}
Console.WriteLine();
double max = array[0];
double min = array[0];
for (int i = 1; i < size; i++) 
{
    if (array[i] > max) 
    {
        max = array[i];
    }
    if (array[i] < min) 
    {
        min = array[i];
    }
}
double diff = Math.Round((max - min)*100);
Console.WriteLine($"Разница между максимальным числом ({max = Math.Round(max * 100)}) и минимальным числом ({min = Math.Round(min * 100)}) массива : " + diff);

/* Массив:
0,982040738587996 0,7309089105592551 0,34683351329115675 0,09523809723068977 0,3449550261676798 0,517341473481445 0,03208419592896694 0,29469718722680216 0,43130832327233326 0,10360422993392582
Разница между максимальным числом (98) и минимальным числом (3) массива : 95
PS C:\Users\poval\Desktop\Homework_4\Task_3> dotnet run
Массив:
0,12229735406397435 0,6191603230367225 0,8002799229190852 0,9479665930568197 0,4878936489797161 0,5727303031511568 0,5829458431560022 0,7013481077025384 0,896211804601187 0,8204132465607317
Разница между максимальным числом (95) и минимальным числом (12) массива : 83
PS C:\Users\poval\Desktop\Homework_4\Task_3> dotnet run
Массив:
0,9608764923184746 0,4638268213563428 0,458093458682014 0,7292117675746851 0,7439075772755681 0,48412395523156215 0,2463771185088064 0,4470455129028782 0,038978351962479785 0,5221266786854184 
Разница между максимальным числом (96) и минимальным числом (4) массива : 92 */
